tgi/nfa.html
---
layout: page
title: Nfa
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Endliche nicht-deterministische Automaten</h2>
<div class="outline-text-2" id="text-1">
<p>
Ein endlicher <i>nicht-deterministischer Automat</i> (NFA oder NEA) ist ein
Tupel \(M=(Q,\Sigma,\delta,q_{0},F)\) aus:
</p>

<ul class="org-ul">
<li>einer endlichen Menge \(Q\) von Zuständen (<i>Zustandsmenge</i>)
</li>
<li>einem Alphabet \(\Sigma\)
</li>
<li>einer Transitionsfunktion
\(\delta: Q \times \Sigma_{\epsilon} \rightarrow \mathcal{P}(Q)\)
</li>
<li>einem <i>Anfangszustand</i> \(q_{0} \in Q\)
</li>
<li>einer Menge \(F\) von <i>Endzuständen</i>
</li>
</ul>

<p>
Dieses Automatenmodell heißt <i>nicht-deterministisch</i>, da es zu jedem
Wort \(w\) mehrere Möglichkeiten (oder auch keine Möglichkeit) gibt das
Wort zu lesen. Es kann also zu jedem Wort \(w \in \Sigma^*\) <b>mehrere</b>
(oder auch keine) Berechnungen geben. Diese können akzeptierend oder
nicht akzeptierend sein (wenn \(w \in L(M)\) gilt gibt es mindestens eine
akzeptierende Berechnung).
</p>

<p>
Man kann sich einen NFA so vorstellen, dass er zu einem gegeben Wort \(w\)
allen mit \(w\) beschrifteten Pfaden sucht. Er kann sich also so gesehen
in mehreren Zuständen (oder auch in keinem Zustand) befinden.
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Jede Sprache, die von einem NFA erkannt wird ist regulär,
</li>
<li>Jeder NFA ist zu einem DFA äquivalent.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Berechnung</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Sei \(M = (Q,\Sigma,\delta,q_0,F)\) ein NFA und \(w\) ein Wort über
\(\Sigma\). Eine <i>Berechnung</i> von \(M\) auf \(w\) ist eine Folge
\(r:=(r_0,r_1,\dots,r_n)\) von Zuständen \(r_i \in Q\) für mit folgenden
Eigenschaften:
</p>

<ol class="org-ol">
<li>\(w\) lässt sich schreiben als \(w=w_0\dots{}w_{n-1}\) mit
\(w_i \in \Sigma_{\epsilon}\) (\(w_i\) kann also auch \(\epsilon\) sein)
</li>
<li>\(r_0 = q_0\)
</li>
<li>\(\forall i \leq n: r_{i+1} \in \delta(r_i,w_i)\)
</li>
</ol>

<p>
\(M\) <i>akzeptiert</i> (engl. <i>accept</i>) \(w\) (man sagt auch eine Berechnung auf
\(w\) ist <i>akzeptierend</i>), falls gilt:
</p>

<ol class="org-ol">
<li>\(r_m \in F\)
</li>
</ol>

<p>
Die Menge der von \(M\) akzeptierten Wörter bildet eine <i>formale Sprache</i>
\(L(M) := \{ w \in \Sigma* | M \text{ akzeptiert } w \}\). \(L(M)\) wird
auch die von \(M\) <i>erkannte Sprache</i> genannt (engl. <i>recognize</i>).
(<b>Merke:</b> ein Automat kann viele Wörter <i>akzeptieren</i>, aber nur eine
Sprache <i>erkennen</i>.)
</p>

<p>
Berechnungen kann man sich vorstellen als Pfade, die in \(q_0\) beginnen
und die mit \(w\) beschriftet sind.
</p>
</div>
</div>
</div>
